label alt_day7_me_neu_dr_neu_old:
    play music music_7dl["see_one_day"] fadein 3
    scene
    $ renpy.show("bg int_d3_hideout_7dl", what = Grayed ("bg int_d3_hideout_7dl"))
    with fade
    "Nazi yowai ka? Это по-японски."
    "Красивый язык, с практически безупречным балансом между фонетикой и эмоциями."
    "Так звучит вопрос о твоей слабости."
    "Ты знаешь, почему ты слаб?"
    "Потому что не веришь ни во что. Утратил смысл и стимул."
    "У современного человека с этим вообще уйма проблем."
    "Даже в зелёных человечков, в волшебника в голубом вертолёте, в бога, рандом или случайные совпадения мы верим охотнее, чем в самую обычную любовь к ближнему."
    "А человеку жизненно необходимо верить."
    "Иначе никак!"
    "Хотя бы в реальность собственного бытия."
    "В то самое незыблемое нечто, старательно раскачиваемое импотентами всех мастей с Сартром во главе."
    "И, судя по тому, что творится сейчас… У них получается?"
    "Ты уже перестал верить в то, что всё творящееся вокруг происходит с тобой на самом деле."
    scene bg ext_emptiness_7dl
    show un2 serious winter
    show prologue_dream
    with fade
    voice "Обнимай меня так крепко, чтобы шумело в ушах, чтобы дыхания не хватало!"
    me "Но… Зачем?"
    voice "Иначе я начинаю думать. {w}А влюблённая женщина думать не должна."
    me "Иди сюда, влюблённая женщина."
    "Я тихо улыбнулся, перелистывая ещё одну страницу из книги в зелёном переплёте."
    hide un2 with dissolve
    "Избранные воспоминания."
    "Возможно, они в самом деле иллюзорны, я видел их во сне, представил себе или надумал, пытаясь предугадать развитие событий."
    "Но менее ценными они от того не становятся."
    scene anim prolog_3
    with dissolve
    voice "Пожалуйста, проснись!"
    "Я лежал в тишине, а внутри меня ниоткуда играла музыка, странная по всем меркам."
    "Это могло означать всё, что угодно."
    "В том числе и то, что я без сознания нахожусь на больничной койке, примотанный ремнями, и лишь краем уха воспринимаю звуки радио, местную музыку."
    "Возможно — и не исключено, что я переломанный после автомобильной аварии, борюсь за жизнь."
    "Или вовсе был таким всегда, и лишь неоспартанская мораль велит беречь абсолютно любую жизнь."
    "Потому все уродцы, убогие, больные, неполноценные, с церебральным параличом, аутизмом и чёрт знает чем ещё так же плотно прификсированы к койкам и видят сны о том, как с заснеженных улиц забирает их «четыреста десятый»."
    "Забирает во вторую декаду июля восемьдесят девятого года, а на деле сейчас — май две тысячи двухсотого или около того."
    "За больными следит интеллектроника, из ленточных динамиков длиной на всё отделение звучит нетленка местного инструменталиста, и больные внемлют, чуть качая головой в такт."
    "Могут поджимать губы, могут морщить нос — во внутреннем дворике больницы среди неукротимой зелени вокруг врытого в землю столика собрались молодые, весёлые, смеющиеся доктора и сёстры, жарко пышет мангал, и аппетитные порывы запаха свежего шашлычка порой заносит в открытую форточку."
    "Звучат анекдоты и тосты, с задорным плеском льётся в пластиковые стаканчики «Агдам»… Люди продолжают жить на всех уровнях реальности."
    scene anim prolog_10
    with dissolve
    voice "Ну, проснись же!"
    "Или, возможно, не всё так радужно, и ты на самом деле замер в растянувшемся мгновении, не чувствуя ещё, как рулевая колонка прошибла тебе грудную клетку и мгновенно убила."
    scene bg ext_entrance_night_clear_7dl
    $ renpy.show("uvao_d1", at_list = [center], what = Notch("uvao_d1"))
    show prologue_dream
    with dissolve
    "Вот в этом самом мгновении ты и глазеешь на крашеные шаровой краской ворота, улыбаешься тянущей руку девушке с кошачьими ушами и соглашаешься на очередной поход с ней."
    me "Пойду, милая…"
    "Беззвучно шевелятся окровавленные губы."
    "И…"
    "Любой человек не умирает."
    "Он переносится туда, где наиболее уместен."
    "Поэтому смерти нет — да кто ж позволит так бездарно расходовать бесценный ресурс душ?"
    "Я думаю, что никто."
    "Но однажды всё равно предстоит как старый плащ сбросить с себя плоть и распахнуть паруса."
    "Раньше или позже…"
    "Если ты везунчик — ты уже нашёл это место, ты уже находишься здесь, пока плоть медленно умирает."
    "Если же нет… Что ж, наберись терпения."
    "Возможно, ты не завершил то, что должен был."
    "Не выполнил задачу, решения ради которой оказался здесь."
    "Например…"
    hide uvao_d1 with dissolve2
    "Настоящее."
    "То самое настоящее, ради которого всё и затевалось."
    scene
    $ renpy.show("bg int_d3_hideout_7dl", what = Grayed("bg int_d3_hideout_7dl"))
    with dissolve
    am "Ты так и не смог простить себя, да?"
    me "Я пытался."
    "Угрюмо сообщил я."
    "Откуда он знает, я спрашивать не стал."
    "Мы не спрашиваем у ноги, что у неё болит или где чешется — мы просто знаем."
    "А от него слабо пахло дёгтем и высокой скоростью, толпой на Маяковской и ударом в нос."
    "Всё сущее имеет начало, но он… {w}Он был раньше."
    am "Что ж."
    "Грустно улыбнулся Дём."
    am "Раз ты ещё не готов — иди."
    am "Прощай себя, становись цельным и настоящим."
    with fade
    am "Натянется и лопнет струна, смешаются в воздухе запахи барбариса и полыни, и ты проснёшься от звонка в дверь — уже зная, кто стоит на пороге. Пойдёшь открывать?"
    am "А кто там?"
    am "Знаешь?"
    me "Знаю…"
    play sound sfx_head_heartbeat
    "Струна лопнула."
    "Главное желание."
    "Выдох."
    scene bg ext_city_night_7dl
    with fade
    play ambience ambience_7dl["night_city"] fadein 3
    "Небо над головой стояло несправедливо питерское, низкое, хмурое, как будто я и не уезжал из родного города."
    "И ведь не скажешь, что от дома меня отделяют аж три часовых пояса…"
    "Самое главное…"
    "В воздухе снова пахнуло скоростью, ошеломлением и дождевой хмарью."
    "Меня сильно толкнуло в спину — так, что я чуть не успел сделать шаг вперёд."
    "Резко развернулся."
    with fade
    me "Ты!"
    "И отшвырнул её в сторону."
    "Десять лет я прогнозировал эту ситуацию, представлял, как можно поступить, чтобы спасти нас обоих."
    "Но это никогда не получалось."
    scene cg d7_me_jeep_7dl with fade
    "Джип шёл на нас юзом, перекрывая всю полосу, поэтому отпрыгнуть в стиле избранного не получится никак."
    "Один кто-то всегда останется на пути следования многотонной махины."
    th "Так уж и многотонной."
    "Я всегда спорил с этим, возмущался, один раз даже сделал симуляцию на компьютере и несколько недель гонял расчёты."
    "Мне хотелось, чтобы и я, и…"
    "Тщетно."
    "Десять лет схимы и ненависти к самому себе."
    "Десять лет поиска смерти для того, чтобы однажды самому себе сказать:"
    me "И хрен с ним."
    me "Пусть уж лучше это буду я."
    "Я!"
    play sound sfx_7dl["car_crash"] fadein 1
    "Девушка откатилась назад с такой скоростью, что с успехом разминулась с джипом, и, лишь убедившись в несовпадении траекторий, я перевёл взгляд на приближающуюся угрозу и оскалился."
    me "Come to papa."
    with fade
    th "Надеюсь, будет насмерть."
    "Успело мелькнуть в голове, после чего был удар."
    with vpunch
    scene black
    show spill_gray
    show spill_red
    with fade
    "Визг тормозов, треск пластика, шуршание заживо раздираемого металла."
    "Порвало и штаны и куртку, специально купленную для таких целей."
    "Кошмар, две стипухи!"
    "Скрипя зубами, я обернулся…"
    scene bg ext_emptiness_7dl
    with dissolve
    "И ошалело уставился на сложившийся автомобиль."
    "Такое ощущение, что он впечатался в бетонный столб, а не в меня."
    "Джип сложился вокруг моей окостеневшей фигурки всмятку, отскочил назад на полметра."
    "Махина, весом раз в восемьдесят превышающая мой собственный, остановилась как вкопанная."
    "Человек, который после встречи со мной однажды брал кредит в банке, так как медстраховка не покрыла всех расходов, сидел и таращился на меня."
    th "Ну нихрена себе."
    "Привычно подумал я, ожидая реплики внутреннего собеседника."
    "Да только не было реплики."
    "Не было ответа."
    "Я был один в своей голове — одинокий и никому не нужный."
    "Ни-ко-му."
    "Или…"
    "На меня налетел вихрь, задёргал за руки, захватал, закричал на разные голоса."
    show un2 scared winter with dissolve
    with hpunch
    un "Семён, Семён, ты живой?! Слава богу, Семён!"
    hide un2 with pixellate
    "Зеленоглазый, тёмноволосый."
    "Тот самый вихрь, который не позволял мне простить себя — ведь только сейчас я оказался там, где должен был."
    "Это мне всё нипочём."
    "Я не знаю, что и как случилось."
    "Но сейчас сквозь толстый слой туч пробился невесть откуда взявшийся солнечный луч, ослепил, высветил…"
    with flash
    "…как горка шариков, всю жизнь обитающая в моём левом глазу, взметнулась ввысь и растянулась математически выверенной спиралью."
    "Цепочкой, похожей на ДНК. {w}События, важные люди, совпадения, сюжеты…"
    "Самое главное — прощение."
    "Самое главное… Лена."
    "Лена…"
    "Только сейчас до меня дошло — что произошло на самом деле."
    "Во всей наивно-глупой фантастичности предо мной предстало сотню раз обдуманное и распланированное прошлое."
    "Моё прошлое десятилетней давности."
    show blinking
    "Всё ещё так глупо начиналось: меня не хотели пропускать, ссылаясь на то, что небритый я в паспорте уж больно отличаюсь от бритого меня наяву."
    "К счастью, приехали мы здорово загодя, потому сутки спустя я уже успел обрасти достаточно, чтобы меня с извинениями отпустили."
    "Лена же… Она хотела съездить в Лондон. {w}Потому и согласилась."
    "У неё было художественное образование и удивительно реалистичные для её зрения картины."
    "Она не имела отношения к программированию и этой олимпиаде, не имела отношения ко мне, но…"
    "И вот, когда мы распаковались и отправились гулять под дождём, случилось то, что случилось."
    "Катализатор кошмара."
    "День, когда я проклял всё и пообещал сам себе, что больше ни-ни и никогда."
    "И так боялся быть один, что даже обрадовался появившимуся в голове гостю."
    "Теперь же…"
    show ka sad swim with dissolve
    "…грустно улыбнулись полные губы, и невысокая фигуристая девушка в зелёном купальнике истёрлась из памяти…"
    scene anim intro_9
    with pixellate
    "…старый краснобокий автобус так ни разу и не забрал с автобусной остановки промёрзшего насквозь невзрачного парня…"
    scene bg ext_camp_entrance_day
    with dissolve
    "…не стало того странного места, куда я вышел однажды, автоматически переставляя ноги — я там не был, поэтому не встретил там нечто, поселившееся у меня в голове, пошлое и мудрое…"
    scene
    $ renpy.show("cg d7_me_looney_7dl", what = Grayed("cg d7_me_looney_7dl"))
    with pixellate
    "…не стало десяти лет скорби и незнания, куда приткнуть себя…"
    "Осталось только чистое и обнажённое эго."
    scene anim prolog_2
    show un2 sad winter
    with dissolve
    un "Что ты молчишь, Вреднище?!"
    "Сквозь пелену тишины прорвался, наконец, возмущённый вопрос, а рукав куртки, за который она хваталась, с треском остался у неё в руках."
    "И я поднял голову, поймал её взгляд и, сделав шаг вперёд, поймал её руки."
    show un2 surprise winter close with dissolve
    "Поймал её губы."
    "Сделал то, что пятнадцать лет назад пора было."
    "Наконец-то…"
    "И задохнулся от счастья:"
    th "Живая…"
    "Только невесть откуда мазнуло по сознанию неуместным запахом свежей листвы и шашлыка."
    "Да неровное пищание, звучащее в подсознании, сгладилось до ровного и чистого звука."
    "Затухающего."
    "Но меня это уже не волновало."
    play sound sfx_7dl["aunl"]
    show acm_logo_me_neu_dr_neu_old with moveinright:
        pos (1600, 1020)
    pause(7.4)
    $ sdl_stories_return()
