label alt_day7_mi_7dl_vatashi:
    scene bg ext_emptiness_7dl with dissolve
    "Так чем же закончилась история?"
    "Между той и этой стороной разница не очень большая."
    "Но её хватило на то, чтобы пустить по замкнутой петле жизнь одного ничем не примечательного молодого человека."
    "О котором и шёл здесь рассказ."
    "Бывает так, что ты смотришь на мир — как всегда, от первого лица, и не хватает только указующего маркера, что ткнёт тебя в то, где ты всего нужнее."
    play music "<to 112>" + music_7dl["youareours"] fadein 3
    "Или находишь записку, которая заставляет поверить в то, что ты здесь не просто так."
    "То, что иной досужий разум величает Высшей Целью Жизни."
    play ambience ambience_7dl["night_city"] fadein 2
    scene anim intro_8 with dissolve
    "И так, строго говоря, получается, что Высшей Целью этого невзрачного человека было — просто появиться в жизни нескольких людей."
    "Появиться и наставить их на путь истинный."
    "Иногда бывает так, что и не встряхнёшься, не посмотришь на себя со стороны, пока кто-нибудь не возьмёт тебя за шкирку и носом не натыкает."
    scene anim intro_6 with dissolve
    "Только тогда, ужаснувшись, начинаешь что-то делать."
    scene cg d5_mi_conv_7dl
    show gfx bokeh
    with dissolve
    "Мику забросила музыкальную карьеру, когда поняла, что это путь в никуда."
    "Ты можешь скакать по сцене, пока тебе шестнадцать, восемнадцать, двадцать."
    "Но однажды тебе стукнет тридцать пять, и для дальнейших прыжков придётся насиловать собственное тело, а там какое уж счастье от дела всей своей жизни?"
    "Так что она нашла себя в социальной педагогике."
    "Вдохновившись судьбой Алисы (а она тщательно следила за судьбой всех своих старых друзей… Только Сенечку разыскать не сумела), она решила устроить аналог советской Программы Социальной Адаптации и Реабилитации."
    "На это ушло восемь лет и почти все деньги семьи."
    scene bg int_concert_room_7dl with dissolve
    "Но в результате Мику-сама преуспела, и в первый же год работы Центра новых родителей нашло около двадцати детишек."
    "Место, где ты больше никогда не будешь одинок."
    "И не передать всё счастье, что она чувствовала, когда ожесточённый в прошлом волчонок оборачивался в её сторону, не выпуская из руки ладони своей новой мамы."
    "И шептал «аригато»."
    scene cg d7_dv_rf_reject_old_7dl:
        pos (0,-1261)
        linear 10.0 pos (0,0)
    "Алису видели на многих квартирниках."
    "Поговаривали, что после переезда в Лениград она водила дружбу с Бутусовым, Науменко и Дягилевой."
    "Но то ли рыжая бестия разочаровалась в собственных песнях, то ли пересмотрела отношение к музыке вовсе — теперь её всё реже можно было встретить с гитарой."
    "Она решила заниматься кое-чем другим и очень многим музыкантам помогла — кому с поиском первой площадки и получением гонорара, кому — с записью дебютной пластинки."
    "Но продюсерская карьера не слишком-то грела непоседливую Алису, потому по завершении контракта она не стала продлевать его, ушла на вольные хлеба."
    scene cg d7_dv_alice_dj_7dl
    with dissolve
    "Её интересовала жизнь — вся, la vida loca — а потому несложно догадаться, каким именем она назвала собственную радиостанцию, поселившуюся в питерском эфире."
    "Радиостанцию, которую выбирали для себя злые, дерзкие и юные — такие, какой всегда и была Алиса."
    scene cg d1_sl_dinner_day_7dl with dissolve
    "Славя искала себя дольше прочих — она успела поработать и преподавателем этики, и в центрах реабилитации, и даже немного на партийной должности."
    "Но что-то это было всё не то, не грело и не радовало."
    "Так что ведомая сердцем, проснулась однажды Славушка куратором ЮНЕСКО в своём родном Калинине — ответственной за архитектурные памятники да за культурное наследие."
    "И только тогда почувствовала себя на своём месте."
    "В конце концов, сохранить память длиной в тысячелетия подчас может значить ничуть не меньше, чем спасение чьей-то отдельно взятой жизни."
    scene bg int_editorial_day_7dl with dissolve
    "Лена… Она мечтала быть художницей."
    "Но отец настоял на поступлении в политех."
    "То, чего она никогда не смогла ему простить."
    "Просто потому, что спустя десять лет работы, поняла, что ещё чуть-чуть — и она сойдёт с ума от постоянного стресса."
    "И как головой в полынью — сумку на плечо, сбережения на билет — по конкурсу оказалась на бюджетном дневном в Мухинском."
    "А ей уже тридцать пять."
    scene cg d4_un_reject_7dl with fade
    "Тогда же первая проданная картина."
    "Первая выставка в тридцать семь."
    "Приглашение сначала в Эрарту, а после и в Нью-Йоркский музей современной живописи в тридцать восемь."
    "Известность? Да. Но сколько времени потрачено впустую."
    scene cg d5_sh_us with fade
    "Ульянка так ничему и не научилась."
    "Она всё бегала."
    "Бегала."
    "Ей говорили заниматься и искать свой путь — она кивала и бегала."
    "Ей было так веселее, и никто никогда не мог догнать её."
    "Показала язык, выкрикнула словцо — и ноги в руки."
    "Так всю жизнь."
    "Сначала юниором."
    with fade
    "Потом за город."
    "А итог — за Олимпийскую сборную."
    "В конце концов, нет силы, способной противостоять настоящему детскому «хочу»."
    "Не верите? А вы дуньте против ветра да загадайте — увидите, что произойдёт."
    scene anim intro_5 with dissolve
    "И только судьба Семёна, этого человека-катализатора, так и осталась неизвестной."
    "Или нет?"
    stop music fadeout 4
    "Но ему слово."
    stop ambience fadeout 3
    pause(1.5)
    scene bg ext_musclub_snowy_day_7dl
    play music music_7dl["sam_lullaby"] fadein 1
    show snow
    "Я так часто видел это место в своих снах, в грёзах, на фотографиях, что сейчас крайне странно и даже в чём-то жутковато стоять здесь."
    "Сердце трепетало, а меня всего колотило в предвкушении новой встречи."
    "Или её отсутствия."
    with fade
    "Странности добавляло и то, что это место обычно являлось мне в своём летнем обличье, а сейчас под ботинками хрустел снег."
    "Там, где привычно цвёл осотник, сейчас торчали растопыренные пальцы, пересыпанные снежком, тропинки были заметены снегом, а на ажурной деревянной решётке балюстрады было где-то по колено."
    "Мику была всегда."
    "С первого же дня, когда прибежала первой — посмотреть на новенького."
    "Я проснулся, когда она подошла к окну автобуса и посмотрела на меня."
    "Сам дом, скованный морозом, будто подобрался, выглядел теперь строго и неприступно, весь покрытый изморозью."
    scene bg ext_musclub_snowy_day_7dl:
        zoom 1.2
    with dissolve
    show snow
    "Во времена оны снаружи можно было разглядеть и морозные узоры внутри окон — красивые-красивые."
    "Но столько времени миновало — дерево давным-давно сменили пластиком, да и сам домик уже не тот…"
    "Не знаю, стучала ли она в окно, или всё дело в моей ковбойской привычке — нетерпимости, когда кто-то нависает «над душой». Но я проснулся."
    "Это как импринтинг, запечатление. Я увидел её первой, когда открыл глаза, поэтому она неизбежно произвела самое яркое впечатление."
    "День Мику. И только от его остроты я до самого последнего не верил в то, что она мне не привиделась — хорошо, хоть перехватил её на ужине, когда та по какой-то надобности села ужинать рядом с Виолеттой."
    "Но конечно, кое-что осталось."
    "Остались деревья, остались скамейки."
    "Самое главное — остался тот самый воздух, каким он бывает лишь там, где люди по-настоящему счастливы."
    "Где смех искреннен, а чувства неподдельны."
    "Доска, где раньше висели расписания, была занавешена флагом — стилизованная ладонь и сердце."
    "Логотип организации, где, по слухам, трудилась одна моя знакомая…"
    scene bg ext_musclub_snowy_day_7dl:
        zoom 1.3
    with dissolve
    show snow
    "Сквозь стёкла на двери пробивался уютный жёлтый свет — меня там не ждали."
    "Возможно, даже не хотели. Но раз пришёл — поздно праздновать труса."
    "Несколько шагов по скрипучей лестнице, по протоптанной тропинке, и…"
    play sound sfx_open_door_2
    pause(1)
    scene bg int_musclub_day with dissolve
    me "В-ватаси ва?"
    play sound sfx_7dl["aunl"]
    $ sdl_persistent_inc("mi_7dl_dr_exc")
    show acm_logo_mi_7dl_dr_exc with moveinright:
        pos (1600, 1020)
    pause(7.4)
    $ sdl_stories_return()